Repository: diogomatheus/taco-visualizer
Catalog: src/assets/i18n/messages.*.xlf
Languages: pt_br

source: Comparator
pt_br: Comparador

source: Builder
pt_br: Construtor

source: About
pt_br: Sobre

source: Brazilian Table of Food Composition (TACO) - Version 4
pt_br: Tabela Brasileira de Composição de Alimentos (TACO) - Versão 4

source: Select a category
pt_br: Selecione uma categoria

source: Description
pt_br: Descrição

source: Energy (kcal)
pt_br: Energia (kcal)

source: Lipid (g)
pt_br: Lipídeos (g)

source: Protein (g)
pt_br: Proteína (g)

source: Carbohydrate (g)
pt_br: Carboidrato (g)

source: Actions
pt_br: Ações

source: View information
pt_br: Visualizar informações

source: Reference: The University of Campinas (UNICAMP), 2011, Brazilian Table of Food Composition, 4 ed., 161p. Available in: <a>https://www.nepa.unicamp.br/taco/tabela.php?ativo=tabela</a> Access in: 20 May 2021, 12:00:00.
pt_br: Referência: Universidade Estadual de Campinas (UNICAMP), 2011, Tabela Brasileira de Composição de Alimentos, 4 ed., 161p. Disponível em: <a>https://www.nepa.unicamp.br/taco/tabela.php?ativo=tabela</a> Acesso em: 20 mai. 2021, 12:00:00.

source: Food Comparator
pt_br: Comparador de Alimentos

source: Food selection
pt_br: Seleção de alimentos

source: Compare
pt_br: Comparar

source: Criteria
pt_br: Critério

source: Select the food attributes
pt_br: Selecione os atributos de alimento

source: Comparison
pt_br: Comparação

source: Back
pt_br: Voltar

source: Meal Builder
pt_br: Construtor de Refeições

source: General
pt_br: Geral

source: Next
pt_br: Próximo

source: Meal information
pt_br: Informações da refeição

source: Meal time
pt_br: Hora da refeição

source: Breakfast
pt_br: Café da manhã

source: Collation
pt_br: Colação

source: Lunch
pt_br: Almoço

source: Afternoon Snack
pt_br: Lanche da tarde

source: Pre-Workout
pt_br: Pré-treino

source: Post-Workout
pt_br: Pós-treino

source: Dinner
pt_br: Jantar

source: Meal type
pt_br: Tipo de refeição

source: Weekdays
pt_br: Dias da semana

source: Monday
pt_br: Segunda-feira

source: Tuesday
pt_br: Terça-feira

source: Wednesday
pt_br: Quarta-feira

source: Thursday
pt_br: Quinta-feira

source: Friday
pt_br: Sexta-feira

source: Saturday
pt_br: Sábado

source: Sunday
pt_br: Domingo

source: Food composition
pt_br: Composição de alimento

source: Composition type
pt_br: Tipo de composição

source: Calculated meal
pt_br: Refeição calculada

source: Open meal
pt_br: Refeição aberta

source: Meal description
pt_br: Descrição da refeição

source: Meal observation
pt_br: Observações da refeição

source: Observation
pt_br: Observação

source: Meal
pt_br: Refeição

source: Print
pt_br: Imprimir

source: The TACO (Brazilian Table of Food Composition) project, coordinated by the University of Campinas (UNICAMP), is an initiative to offer data on an expressive number of nutrients in national and regional foods obtained through representative sampling and analyzes carried out only by laboratories with analytical competence proven by interlaboratory studies, according to international criteria.
pt_br: O projeto TACO (Tabela Brasileira de Composição de Alimentos), coordenado pela Universidade Estadual de Campinas (UNICAMP), é uma iniciativa para oferecer dados de um expressivo número de nutrientes em alimentos nacionais e regionais obtidos por meio de amostragem representativa e análises realizadas somente por laboratórios com competência analítica comprovada por estudos interlaboratoriais, segundo critérios internacionais.

source: Knowledge of the composition of the food consumed in Brazil is essential to achieve food security in the country. Food composition tables are basic pillars for nutritional education, quality control and food safety, assessment and adequacy of nutrient intake by individuals or populations. Through them, public health officials can establish nutritional goals and food guides that lead to a healthier diet. At the same time that they provide subsidies to researchers of epidemiological studies that relate the diet to the risks of diseases or professionals who need this information for clinical purposes, these data can guide agriculture and the food industries in the development of new products and support policies protection of the environment and biodiversity. They are also necessary for nutrition labeling to assist consumers in choosing food. In addition, in a highly globalized and competitive market, data on food composition serve to encourage national and international food commercialization.
pt_br: O conhecimento da composição dos alimentos consumidos no Brasil é fundamental para o alcance da segurança alimentar no país. Tabelas de composição de alimentos são pilares básicos para educação nutricional, controle da qualidade e segurança dos alimentos, avaliação e adequação da ingestão de nutrientes de indivíduos ou populações. Por meio delas, autoridades de saúde pública podem estabelecer metas nutricionais e guias alimentares que levem a uma dieta mais saudável. Ao mesmo tempo que, forneçam subsídios aos pesquisadores de estudos epidemiológicos que relacionam a dieta com os riscos de doenças ou profissionais que necessitam destas informações para fins clínicos, estes dados podem orientar a agricultura e as indústrias de alimentos no desenvolvimento de novos produtos e apoiar políticas de proteção ao meio ambiente e da biodiversidade. São necessárias também para a rotulagem nutricional a fim de auxiliar consumidores na escolha dos alimentos. Adicionalmente, em um mercado altamente globalizado e competitivo, dados sobre composição de alimentos servem para incentivar a comercialização nacional e internacional de alimentos.

source: Data on the composition of food consumed in different regions of Brazil provide basic elements for nutritional guidance actions based on principles of local development and diversification of food, as opposed to the massification of a monotonous and unbalanced diet. To avoid wrong decisions or conclusions, food composition tables need to be reliable, up-to-date and as complete as possible.
pt_br: Dados sobre a composição de alimentos consumidos nas diferentes regiões do Brasil fornecem elementos básicos para ações de orientação nutricional baseada em princípios de desenvolvimento local e diversificação da alimentação, em contraposição à massificação de uma dieta monótona e desequilibrada. Para evitar decisões ou conclusões equivocadas, as tabelas de composição de alimentos precisam ser confiáveis, atualizadas e o mais completas possíveis.

source: The TACO project is currently in its fourth edition. In the first version, 198 foods were counted. In the most updated edition there are 597 items.
pt_br: O projeto TACO está, atualmente, na quarta edição. Na primeira versão, estavam contabilizados 198 alimentos. Já na edição mais atualizada são 597 itens.

source: Food list
pt_br: Lista de alimentos

source: Select the foods
pt_br: Selecione os alimentos

source: Select a food
pt_br: Selecione um alimento

source: Add
pt_br: Adicionar

source: Measure
pt_br: Medida

source: Unit
pt_br: Unidade

source: Remove
pt_br: Remover

# mat-paginator-intl-items-per-page
source: Items per page
pt_br: Itens por página

# mat-paginator-intl-first-page
source: First page
pt_br: Primeira página

# mat-paginator-intl-last-page
source: Last page
pt_br: Última página

# mat-paginator-intl-next-page
source: Next page
pt_br: Próxima página

# mat-paginator-intl-previous-page
source: Previous page
pt_br: Página anterior

# ng-select-not-found
source: Option not found
pt_br: Opção não encontrada

# ng-select-clear-all
source: Clear
pt_br: Limpar

# page-title-home
source: Food Visualizer - TACO V4
pt_br: Visualizador de Alimentos - TACO V4

# page-title-comparator
source: Food Comparator - TACO V4
pt_br: Comparador de Alimentos - TACO V4

# page-title-builder
source: Meal Builder - TACO V4
pt_br: Construtor de Refeições - TACO V4

# page-title-about
source: About - TACO V4
pt_br: Sobre - TACO V4

# food-comparator-first-validation-message
source: Please select at least one criteria and two foods.
pt_br: Por favor, selecione pelo menos um critério e dois alimentos.

# meal-builder-first-validation-message
source: Please fill the general information.
pt_br: Por favor, preencha as informações gerais.

# meal-builder-second-validation-message
source: Please fill the food composition information.
pt_br: Por favor, preencha as informações de composição dos alimentos.

# food-attribute-group-general
source: General
pt_br: Geral

# food-attribute-humidity_percents
source: Humidity (%)
pt_br: Umidade (%)

# food-attribute-energy_kcal
source: Energy (kcal)
pt_br: Energia (kcal)

# food-attribute-energy_kj
source: Energy (kj)
pt_br: Energia (kj)

# food-attribute-protein_g
source: Protein (g)
pt_br: Proteína (g)

# food-attribute-lipid_g
source: Lipid (g)
pt_br: Lipídeos (g)

# food-attribute-cholesterol_mg
source: Cholesterol (mg)
pt_br: Colesterol (mg)

# food-attribute-carbohydrate_g
source: Carbohydrate (g)
pt_br: Carboidrato (g)

# food-attribute-fiber_g
source: Fiber (g)
pt_br: Fibra alimentar (g)

# food-attribute-ashes_g
source: Ashes (g)
pt_br: Cinzas (g)

# food-attribute-calcium_mg
source: Calcium (mg)
pt_br: Cálcio (mg)

# food-attribute-magnesium_mg
source: Magnesium (mg)
pt_br: Magnésio (mg)

# food-attribute-manganese_mg
source: Manganese (mg)
pt_br: Manganês (mg)

# food-attribute-phosphorus_mg
source: Phosphorus (mg)
pt_br: Fósforo (mg)

# food-attribute-iron_mg
source: Iron (mg)
pt_br: Ferro (mg)

# food-attribute-sodium_mg
source: Sodium (mg)
pt_br: Sódio (mg)

# food-attribute-potassium_mg
source: Potassium (mg)
pt_br: Potássio (mg)

# food-attribute-copper_mg
source: Copper (mg)
pt_br: Cobre (mg)

# food-attribute-zinc_mg
source: Zinc (mg)
pt_br: Zinco (mg)

# food-attribute-thiamine_mg
source: Thiamine (mg)
pt_br: Tiamina (mg)

# food-attribute-riboflavin_mg
source: Riboflavin (mg)
pt_br: Riboflavina (mg)

# food-attribute-pyridoxine_mg
source: Pyridoxine (mg)
pt_br: Piridoxina (mg)

# food-attribute-niacin_mg
source: Niacin (mg)
pt_br: Niacina (mg)

# food-attribute-vitaminC_mg
source: Vitamin C (mg)
pt_br: Vitamina C (mg)

# food-attribute-group-fatty_acids
source: Fatty acids
pt_br: Ácidos graxos

# food-attribute-saturated_g
source: Saturated (g)
pt_br: Saturados (g)

# food-attribute-monounsaturated_g
source: Monounsaturated (g)
pt_br: Monoinsaturados (g)

# food-attribute-polyunsaturated_g
source: Polyunsaturated (g)
pt_br: Poliinsaturados (g)

# food-attribute-group-amino_acids
source: Amino acids
pt_br: Aminoácidos

# food-attribute-tryptophan_g
source: Tryptophan (g)
pt_br: Triptofano (g)

# food-attribute-threonine_g
source: Threonine (g)
pt_br: Treonina (g)

# food-attribute-isoleucine_g
source: Isoleucine (g)
pt_br: Isoleucina (g)

# food-attribute-leucine_g
source: Leucine (g)
pt_br: Leucina (g)

# food-attribute-lysine_g
source: Lysine (g)
pt_br: Lisina (g)

# food-attribute-methionine_g
source: Methionine (g)
pt_br: Metionina (g)

# food-attribute-cystine_g
source: Cystine (g)
pt_br: Cistina (g)

# food-attribute-phenylalanine_g
source: Phenylalanine (g)
pt_br: Fenilalanina (g)

# food-attribute-tyrosine_g
source: Tyrosine (g)
pt_br: Tirosina (g)

# food-attribute-valine_g
source: Valine (g)
pt_br: Valina (g)

# food-attribute-arginine_g
source: Arginine (g)
pt_br: Arginina (g)

# food-attribute-histidine_g
source: Histidine (g)
pt_br: Histidina (g)

# food-attribute-alanine_g
source: Alanine (g)
pt_br: Alanina (g)

# food-attribute-aspartic_g
source: Aspartic (g)
pt_br: Ácido aspártico (g)

# food-attribute-glutamic_g
source: Glutamic (g)
pt_br: Ácido glutâmico (g)

# food-attribute-glycine_g
source: Glycine (g)
pt_br: Glicina (g)

# food-attribute-proline_g
source: Proline (g)
pt_br: Prolina (g)

# food-attribute-serine_g
source: Serine (g)
pt_br: Serina (g)
